rr_results/fio_baseline_off_16g_250ms.log
seq-read-loop: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process

seq-read-loop: (groupid=0, jobs=1): err= 0: pid=67069: Mon Jun  1 13:45:32 2026
  read: IOPS=7633, BW=954MiB/s (1000MB/s)(168GiB/180001msec)
    clat (usec): min=121, max=313, avg=130.77, stdev= 6.89
     lat (usec): min=121, max=313, avg=130.79, stdev= 6.89
    clat percentiles (usec):
     |  1.00th=[  123],  5.00th=[  123], 10.00th=[  123], 20.00th=[  123],
     | 30.00th=[  126], 40.00th=[  127], 50.00th=[  135], 60.00th=[  135],
     | 70.00th=[  135], 80.00th=[  139], 90.00th=[  139], 95.00th=[  141],
     | 99.00th=[  143], 99.50th=[  143], 99.90th=[  180], 99.95th=[  188],
     | 99.99th=[  215]
   bw (  KiB/s): min=957952, max=990720, per=100.00%, avg=977237.92, stdev=11023.56, samples=719
   iops        : min= 7496, max= 7738, avg=7634.80, stdev=82.09, samples=359
  lat (usec)   : 250=100.00%, 500=0.01%
  cpu          : usr=0.31%, sys=2.88%, ctx=1374398, majf=0, minf=44
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1373966,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=954MiB/s (1000MB/s), 954MiB/s-954MiB/s (1000MB/s-1000MB/s), io=168GiB (180GB), run=180001-180001msec

Disk stats (read/write):
  nvme1n1: ios=1373169/0, merge=0/0, ticks=174054/0, in_queue=174054, util=96.75%