rr_results/fio_reclaim.log
seq-read-loop: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process

seq-read-loop: (groupid=0, jobs=1): err= 0: pid=35896: Sun May 31 20:45:42 2026
  read: IOPS=7629, BW=954MiB/s (1000MB/s)(168GiB/180001msec)
    clat (usec): min=121, max=476, avg=130.89, stdev=38.51
     lat (usec): min=121, max=476, avg=130.91, stdev=38.51
    clat percentiles (usec):
     |  1.00th=[  123],  5.00th=[  123], 10.00th=[  123], 20.00th=[  123],
     | 30.00th=[  123], 40.00th=[  123], 50.00th=[  123], 60.00th=[  125],
     | 70.00th=[  127], 80.00th=[  127], 90.00th=[  127], 95.00th=[  130],
     | 99.00th=[  383], 99.50th=[  388], 99.90th=[  392], 99.95th=[  392],
     | 99.99th=[  392]
   bw (  KiB/s): min=667803, max=1038478, per=100.00%, avg=976875.49, stdev=110836.77, samples=179
   iops        : min= 5210, max= 8116, avg=7633.04, stdev=902.73, samples=359
  lat (usec)   : 250=96.71%, 500=3.29%
  cpu          : usr=0.25%, sys=2.63%, ctx=1373347, majf=0, minf=44
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1373284,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=954MiB/s (1000MB/s), 954MiB/s-954MiB/s (1000MB/s-1000MB/s), io=168GiB (180GB), run=180001-180001msec

Disk stats (read/write):
  nvme1n1: ios=1372428/0, merge=0/0, ticks=174650/0, in_queue=174651, util=97.12%