rr_results/fio_rrt1024_16g_250ms.log
seq-read-loop: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process

seq-read-loop: (groupid=0, jobs=1): err= 0: pid=75846: Mon Jun  1 14:00:20 2026
  read: IOPS=7636, BW=955MiB/s (1001MB/s)(168GiB/180001msec)
    clat (usec): min=121, max=1369, avg=130.73, stdev=18.28
     lat (usec): min=121, max=1369, avg=130.75, stdev=18.28
    clat percentiles (usec):
     |  1.00th=[  123],  5.00th=[  123], 10.00th=[  123], 20.00th=[  123],
     | 30.00th=[  126], 40.00th=[  127], 50.00th=[  135], 60.00th=[  135],
     | 70.00th=[  135], 80.00th=[  137], 90.00th=[  139], 95.00th=[  139],
     | 99.00th=[  143], 99.50th=[  143], 99.90th=[  182], 99.95th=[  194],
     | 99.99th=[ 1369]
   bw (  KiB/s): min=620544, max=990720, per=100.00%, avg=978105.85, stdev=25815.31, samples=719
   iops        : min= 4862, max= 7738, avg=7641.19, stdev=193.17, samples=359
  lat (usec)   : 250=99.98%, 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.02%
  cpu          : usr=0.30%, sys=2.77%, ctx=1374685, majf=0, minf=44
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1374495,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=955MiB/s (1001MB/s), 955MiB/s-955MiB/s (1001MB/s-1001MB/s), io=168GiB (180GB), run=180001-180001msec

Disk stats (read/write):
  nvme1n1: ios=1373676/0, merge=0/0, ticks=174287/0, in_queue=174287, util=96.97%