rr_results/fio_rrt1024_16g_iod16.log
seq-read-loop: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=16
fio-3.28
Starting 1 process

seq-read-loop: (groupid=0, jobs=1): err= 0: pid=106433: Mon Jun  1 14:36:52 2026
  read: IOPS=26.7k, BW=3338MiB/s (3500MB/s)(587GiB/180001msec)
    slat (nsec): min=1808, max=899556, avg=3370.81, stdev=1236.59
    clat (usec): min=51, max=3119, avg=595.55, stdev=63.57
     lat (usec): min=169, max=3124, avg=598.95, stdev=63.54
    clat percentiles (usec):
     |  1.00th=[  586],  5.00th=[  586], 10.00th=[  594], 20.00th=[  594],
     | 30.00th=[  594], 40.00th=[  594], 50.00th=[  594], 60.00th=[  594],
     | 70.00th=[  594], 80.00th=[  594], 90.00th=[  594], 95.00th=[  594],
     | 99.00th=[  603], 99.50th=[  644], 99.90th=[ 1631], 99.95th=[ 1696],
     | 99.99th=[ 2769]
   bw (  MiB/s): min= 1248, max= 3361, per=100.00%, avg=3339.90, stdev=176.06, samples=720
   iops        : min=13812, max=26884, avg=26718.98, stdev=1171.86, samples=360
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.05%, 750=99.63%, 1000=0.01%
  lat (msec)   : 2=0.30%, 4=0.02%
  cpu          : usr=1.70%, sys=10.35%, ctx=2739307, majf=0, minf=524
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4806470,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=3338MiB/s (3500MB/s), 3338MiB/s-3338MiB/s (3500MB/s-3500MB/s), io=587GiB (630GB), run=180001-180001msec

Disk stats (read/write):
  nvme1n1: ios=2737901/0, merge=2065719/0, ticks=1630824/0, in_queue=1630823, util=100.00%